suricata.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2022-05-05 Thu 19:32 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>使用suricata屏蔽APP</title>
<meta name="author" content="jamesarch" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<header>
<h1 class="title">使用suricata屏蔽APP</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6e9c3c0">原理</a></li>
<li><a href="#org7b99e68">具体操作</a>
<ul>
<li><a href="#org9ddbab3">安装suricata</a></li>
<li><a href="#orga8b8eea">配置IDS模式</a></li>
<li><a href="#org0dc6206">编写规则文件</a></li>
</ul>
</li>
<li><a href="#org5739ceb">缺点</a></li>
</ul>
</div>
</nav>
<div id="outline-container-org6e9c3c0" class="outline-2">
<h2 id="org6e9c3c0">原理</h2>
<div class="outline-text-2" id="text-org6e9c3c0">
<p>
suricata是一套IDS/IPS系统，因为需要实现一个拦截的功能，这里就需要使用到IPS模式，利用IPS来过滤数据包，从而实现拦截的方法。
</p>
</div>
</div>
<div id="outline-container-org7b99e68" class="outline-2">
<h2 id="org7b99e68">具体操作</h2>
<div class="outline-text-2" id="text-org7b99e68">
</div>
<div id="outline-container-org9ddbab3" class="outline-3">
<h3 id="org9ddbab3">安装suricata</h3>
<div class="outline-text-3" id="text-org9ddbab3">
<p>
这里以centos 7为例
</p>
<pre class="example">
yum install epel-release yum-plugin-copr
yum copr enable @oisf/suricata-latest
yum install suricata
</pre>
</div>
</div>
<div id="outline-container-orga8b8eea" class="outline-3">
<h3 id="orga8b8eea">配置IDS模式</h3>
<div class="outline-text-3" id="text-orga8b8eea">
<p>
IDS模式有网卡过滤和NFQUEUE两种模式，这里使用NFQUEUE，也可以根据自身需求来选择，安装完成之后，需要使用iptables来创建对应的规则拦截所有流量
</p>
<pre class="example">
sudo iptables -A INPUT -j NFQUEUE --queue-bypass
sudo iptables -A OUTPUT -j NFQUEUE --queue-bypass
</pre>
<p>
这里的&#x2013;queue-bypass选项是为了防止在流量没有进行处理的时候，不丢弃流量，从而影响正常的网络连接。
之后在/etc/sysconfig/suricata文件里面将OPTIONS的内容改为以下内容
</p>
<pre class="example">
OPTIONS="-q 0 --user suricata"
</pre>
<p>
-q 0的意思是处理NFQUEUE 0的所有内容
</p>
</div>
</div>
<div id="outline-container-org0dc6206" class="outline-3">
<h3 id="org0dc6206">编写规则文件</h3>
<div class="outline-text-3" id="text-org0dc6206">
<p>
在编写规则文件之前，需要运行suricata-update更新下默认的规则，之后将以下规覆盖入到/var/lib/suricata/suricata.yaml文件中
</p>
<pre class="example">
drop tcp any any &lt;&gt; any any (msg:"drop  WeChat tcp 16 "; content:"|16 F1 04|"; sid:6;)
drop tcp any any &lt;&gt; any any (msg:"drop  WeChat tcp 17 "; content:"|17 F1 04|"; sid:7;)
drop tcp any any &lt;&gt; any any (msg:"drop  WeChat tcp 19 "; content:"|19 F1 04|"; sid:8;)
drop tcp any any &lt;&gt; any any (msg:"drop  upgrade mmtls"; content:"Upgrade|3A| mmtls";nocase;  sid:16;)
drop tcp any any &lt;&gt; any any (msg:"drop  WeChat tcp UA"; content:"User-Agent|3A| MicroMessenger Client";  sid:5;)
drop tcp any any &lt;&gt; any any (msg:"drop qq start tcp";content:"|02|";startswith;content:"|03|";endswith;sid:10;)
drop udp any any &lt;&gt; any any (msg:"drop qq start udp";content:"|02|";startswith;content:"|03|";endswith;sid:11;)
drop tls any any -&gt; any any (msg:"block wx.qq.com";tls.cert_subject;content:"wx.qq.com"; sid:18;)
</pre>
<p>
最后运行suricata -T检测规则是否合格，如果正常没报错的话，可以重启服务观察是否有拦截到流量
</p>
<pre class="example">
systemctl restart suricata
iptables -nvL #查看是否有流量经过
tail -f /var/log/suricata/fast.log #查看是否有对应的输出
</pre>
</div>
</div>
</div>
<div id="outline-container-org5739ceb" class="outline-2">
<h2 id="org5739ceb">缺点</h2>
<div class="outline-text-2" id="text-org5739ceb">
<p>
经过测试在hyper-v环境下过滤100台左右的虚拟机会出现延迟高丢包的情况，猜测和网卡以及NFQUEUE性能有关。暂时没有深入研究原因 
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#20316;&#32773;: jamesarch</p>
<p class="date">Created: 2022-05-05 Thu 19:32</p>
</div>
</body>
</html>
